app/controllers/categories_controller.rb

  def index
    @categories = Category.all
    @category = Category.find_by(id: params[:category_id])
---
SELECT "categories".* FROM "categories"
SELECT "categories".* FROM "categories" WHERE "categories"."id" IS NULL LIMIT $1  [["LIMIT", 1]]

  def create
    @categories = current_user.categories.new(category_params)
    if @categories.save
---
INSERT INTO "categories" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Clothing"], ["icon", "clothing"], ["user_id", 1], ["created_at", "2023-10-12 02:36:26.632638"], ["updated_at", "2023-10-12 02:36:26.632638"]]

  def show
    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def set_user
    @user = User.find_by(id: params[:user_id]) || current_user
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]