app/controllers/operations_controller.rb

  def index
    @category = Category.find(params[:category_id])
    @operations = @category.operations.order(created_at: :desc)
    @total_amount = @operations.sum(:amount)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "operations".* FROM "operations" WHERE "operations"."category_id" = $1 ORDER BY "operations"."created_at" DESC  [["category_id", 6]]
SELECT "operations".* FROM "operations" WHERE "operations"."category_id" = $1  [["category_id", 6]]
SELECT SUM("operations"."amount") FROM "operations" WHERE "operations"."category_id" = $1  [["category_id", 6]]

  def create
    @category = Category.find(params[:operation][:category_id]) # Esto obtiene la categoría seleccionada del formulario.
    @operation = @category.operations.build(operation_params)
    @operation.user = current_user

    if @operation.save
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "operations" ("name", "amount", "category_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Lunch"], ["amount", "25.0"], ["category_id", 6], ["user_id", 1], ["created_at", "2023-10-12 02:52:53.255362"], ["updated_at", "2023-10-12 02:52:53.255362"]]

  def set_category
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]