app/views/categories/index.html.erb

SELECT "operations".* FROM "operations" WHERE "operations"."category_id" IN ($1, $2, $3)  [["category_id", 1], ["category_id", 2], ["category_id", 3]]
SELECT SUM("operations"."amount") FROM "operations" WHERE "operations"."category_id" = $1  [["category_id", 7]]
---
          </div>
          <p class="posts-counter"><%= number_to_currency(category.operations.sum(:amount), unit: "$") %></p>