app/views/operations/index.html.erb

SELECT "operations".* FROM "operations" WHERE "operations"."category_id" = $1 ORDER BY "operations"."created_at" DESC  [["category_id", 1]]
SELECT SUM("operations"."amount") FROM "operations" WHERE "operations"."category_id" = $1  [["category_id", 7]]
---
        </div>
        <p class="posts-counter all low"><%= number_to_currency(@category.operations.sum(:amount), unit: "$") %></p>