app/views/operations/new.html.erb

    <div>
    <%= f.collection_select(:category_id, Category.all, :id, :name, prompt: 'Select a category', class: 'input') %>
---
SELECT "categories".* FROM "categories"